tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "moncho/dry"
tap "mongodb/brew"
tap "sanemat/font"
brew "anyenv"
brew "libpng"
brew "go"
brew "mas"
brew "mysql"
brew "mysql@5.7"
brew "nginx"
brew "postgresql"
brew "redis"
brew "ruby-build"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"
brew "moncho/dry/dry"
brew "mongodb/brew/mongodb-community"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "sequel-pro-nightly"
cask "sourcetree"
cask "visual-studio-code"
mas "Alfred", id: 405843582
mas "Logic Pro X", id: 634148309
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
