tap "caskroom/cask" || true
tap "caskroom/versions"
tap "homebrew/bundle"

brew "openssl"
brew "mpfr"
brew "autoconf"
brew "xz"
brew "jpeg"
brew "libpng"
brew "libxml2", link: true
brew "libxslt", link: true

brew "gcc"
brew "lua"
brew "the_silver_searcher"

brew "git"
brew "tmux"
brew "docker"
brew "vim", args: ["override-system-vi"]
brew "macvim", args: ["with-lua", "with-override-system-vim"]
tap "neovim/neovim"
brew "neovim"
brew "zsh"
brew "ctags"
brew "pyenv-virtualenv"
brew "tree"
brew "wget"
brew "yarn"

brew "mongodb"
brew "mysql"
brew "nginx"
brew "redis"
brew "sqlite"
brew "postgresql"

cask "iterm2"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "alfred"
cask "google-chrome"
cask "firefox"
cask "dropbox"
cask "docker"
cask "virtualbox"
cask "slack"
cask "1password"
cask "sourcetree"
cask "cacher"
cask "cyberduck"

tap "sanemat/font"
brew "ricty"
brew "sanemat/font/ricty", args: ["vim-powerline"]
